_protected/controllers/LeaveApplicationController.php

INSERT INTO [Payroll_leave_application] ([EmpID], [type_leave], [date_from], [date_to], [status], [date_created], [date_updated]) VALUES ('4334-5', 'LEC_UGSLHAWP', '2019-10-02 13:00', '2019-10-02 14:00', 1, '2019-10-02', '2019-10-02')
---
    public function actionCreate()
    {
        $model = new LeaveApplication();

        if ($model->load(Yii::$app->request->post())) {

            $model->status =LeaveApplication::STATUS_PENDING;
            $model->date_created = date('Y-m-d');
            $model->date_updated = date('Y-m-d');
            if($model->save())

SELECT * FROM [Payroll_leave_application] WHERE ([date_to]='2019-09-24') AND ([EmpID]='4334-5')
---
    protected function findModel($date_to, $EmpID)
    {
        if (($model = LeaveApplication::findOne(['date_to' => $date_to, 'EmpID' => $EmpID])) !== null) {

SELECT * FROM [Payroll_leave_application] WHERE ([EmpID]='4334-5') AND ([date_to]='2019-09-24')
SELECT * FROM [Payroll_leave_application] WHERE ([EmpID]='4334-5') AND ([date_to]='2019-09-16')
SELECT * FROM [Payroll_pay_period] WHERE ([date_from] >= '2019-09-16') AND ([date_to] >= '2019-09-24')
INSERT INTO [SH03_UGLEAVECREDITS] ([EmpID], [PrdID]) VALUES ('4334-5', 'SY201901')
---
    public function actionProcess()
    {

        if(Yii::$app->request->post('ids')){

            $ids = Yii::$app->request->post('ids');

            $leaveApps = array();

            foreach ($ids as $id) {

                $ugLeave = new UgLeaveCredits;
                $leave = LeaveApplication::find()->where(['EmpID'=>$id['EmpID']])->andWhere(['date_to'=>$id['date_to']])->one();

               $payPeriods = PayPeriod::find()->where(['<=','date_from',$leave['date_from']])->andWhere(['>=','date_to',$leave['date_to']])->one();


                var_dump($payPeriods['PrdID']);

                /*
                $ugLeave->EmpID = $leave->EmpID;
                $ugLeave->PrdID = $payPeriods['PrdID'];
                $ugLeave->save();