_protected/controllers/TypeLeaveController.php

INSERT INTO [Payroll_type_leave] ([id], [description], [type]) VALUES ('LEC_UGSLHAWP', 'Lecture Sick Hours Absent With Pay', 1)
---
    public function actionCreate()
    {
        $model = new TypeLeave();

        if ($model->load(Yii::$app->request->post()) && $model->save()) {

SELECT * FROM [Payroll_type_leave] WHERE [id]='LEC_UGSLHAWP'
---
    protected function findModel($id)
    {
        if (($model = TypeLeave::findOne($id)) !== null) {