_protected/controllers/UgLeaveCreditsController.php

SELECT * FROM [SH03_UGLEAVECREDITS] WHERE ([EmpID]='4334-5') AND ([PrdID]='SY201902')
---
    protected function findModel($EmpID, $PrdID)
    {
        if (($model = UgLeaveCredits::findOne(['EmpID' => $EmpID, 'PrdID' => $PrdID])) !== null) {